//#include<iostream>
//using namespace std;
//
//int main()
//{
//	//二维数组的定义方式有以下四种:
//	//1, 数据类型 数组名[行数][列数];
//	int arr[2][3];
//	//接下来是给刚刚定义好的二维数组赋值
//	cout << "第一种定义方式:" << endl;
//	arr[0][0] = 1;
//	arr[0][1] = 2;
//	arr[0][2] = 3;
//	arr[1][0] = 4;
//	arr[1][1] = 5;
//	arr[1][2] = 6;
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 3; j++) {
//			cout << arr[i][j] << " ";
//		}
//		cout << endl;
//	}
//
//
//	//2, 数据类型 数组名[行数][列数] = { {数据1,数据2},{数据3,数据4} }
//	cout << "第二种定义方式:" << endl;
//	int arr1[2][3] = {
//		{1,2,3},
//		{4,5,6}
//	};
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 3; j++) {
//			cout << arr1[i][j] << " ";
//		}
//		cout << endl;
//	}
//
//	//3, 数据类型 数据名[行数][列数] = { 数据1,数据2,数据3,数据4 }
//	cout << "第三种定义方式:" << endl;
//	int arr2[2][3] = { 1,2,3,4,5,6 };
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 3; j++) {
//			cout << arr2[i][j] << " ";
//		}
//		cout << endl;
//	}
//	//4, 数据类型 数据名[][列数] = { 数据1,数据2,数据3,数据4 }
//	cout << "第四种定义方式:" << endl;
//	int arr3[][4] = { 1,2,3,4,5,6,7,8};
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 4; j++) {
//			cout << arr3[i][j] << " ";
//		}
//		cout << endl;
//	}
//
//	system("pause");
//	return 0;
//}