//#include<iostream>
//using namespace std;
//
//int main()
//{
//	//1.常量指针,指针的值不可以修改,指针的指向可以修改
//	int a = 10;
//	int b = 20;
//	const int* p = &a;
//	//*p = 100;  //这个是错误的,因为值不可以修改
//	p = &b; //这个是正确的,因为可以修改指向
//
//	//2.指针常量,指针的值可以修改,指针的指向不可以修改
//	int c = 30;
//	int d = 40;
//	int* const p2 = &c;
//	*p2 = 200;//正确,指针值可以修改
//	//p2 = &d; 错误,指针的指向不可以修改
//
//	//3.既修饰指针又修饰常量,指针的值和指针的指向都不可以进行修改
//	int e = 50;
//	int f = 60;
//	const int* const p3 = &e;
//	//*p3 = 300; 错误,指针值不可以修改
//	//p3 = &f;  错误,指针的指向不可以修改
//
//	system("pause");
//	return 0;
//}