//#include<iostream>
//using namespace std;
//
//int main()
//{
//	//指针和数组
//	//新建一个数组
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//让指针指向数组地址
//	int* p = arr;	//数组名即为数组首地址
//	//利用指针指向数组的第一个元素
//	cout << "数组的第一个元素是:" << *p << endl;
//	//让指针指向数组的第二个元素
//	p++;			//指针向后偏移4个字节的空间,即可以指向数组的第二个元素
//	cout << "数组的第二个元素是:" << *p << endl;
//	//利用指针来遍历数组
//	cout << "指针遍历数组:" << endl;
//	int* p2 = arr;
//	for (int i = 0; i < 10; i++) {
//		cout << "数组的第" << i + 1 << "个元素是:" << *p2 << endl;
//		p2++;
//	}
//	system("pause");
//	return 0;
//}